CS-3365/notes/html_output/1 - Introduction.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-17 Fri 17:38 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="Kieran Lavato" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbda6020">1. Introduction</a></li>
<li><a href="#org7fb97d4">2. Professional software development</a>
<ul>
<li><a href="#org286a858">2.1. Software Products</a></li>
<li><a href="#org243944d">2.2. Attributes of software</a></li>
</ul>
</li>
<li><a href="#org2fc8abb">3. Software process acitivities.</a></li>
</ul>
</div>
</div>
<div id="outline-container-orgbda6020" class="outline-2">
<h2 id="orgbda6020"><span class="section-number-2">1.</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<p>
Why is software engineering important?
</p>
<ul class="org-ul">
<li>Economies of ALL developed nations are dependent on software.</li>
<li>More and more systems are software controlled.</li>
<li>Software engineering is concerned with theories, methods, and tools for professional software development.</li>
<li>More individuals and society rely on advanced software systems.</li>
</ul>

<p>
Software costs:
</p>
<ul class="org-ul">
<li>Software costs often dominate computer system costs.</li>
<li>The costs of software on PC are often greater than the hardware cost.</li>
<li>Costs more to maintain and develop.</li>
<li>For systems with a long life, maintenance costs may be several times development costs.</li>
<li>Concerned with cost-effective software development.</li>
</ul>

<p>
Software project failure is a consequence of two factors:
</p>
<ul class="org-ul">
<li>Increasing time complexity. As new software engineering techniques help us to build larger, more complex systems, the demands change. Systems have to be built and delivered more quickly.</li>
<li>Failure to use software engineering methods. Many companies have drifted into software development as their products and services have evolved.</li>
</ul>
</div>
</div>
<div id="outline-container-org7fb97d4" class="outline-2">
<h2 id="org7fb97d4"><span class="section-number-2">2.</span> Professional software development</h2>
<div class="outline-text-2" id="text-2">
<p>
Common questions:
</p>
<ul class="org-ul">
<li>In the context of software engineering, what is software? Both the computer program + associated documentation.</li>
<li>What are the attributes of good software? It should provide all the functionalities that the customer asks for.</li>
<li>What are the fundamental software engineering activities? Software specification, Software development, Software validation, and Software evolution.</li>
<li>What is the difference between software engineering and computer science? Computer science focuses on theory and fundamentals. Software engineering is the application of such theories (developing and delivering useful software.)</li>
<li>What are the key challanges facing software engineering? Coping with increasing diversity, demands for reduced delivery times, and devoliping trustworthy software.</li>
<li>What are the costs of software engineering? Around 60% of software costs are development costs. Around 40% of the software costs are development costs.</li>
</ul>
</div>
<div id="outline-container-org286a858" class="outline-3">
<h3 id="org286a858"><span class="section-number-3">2.1.</span> Software Products</h3>
<div class="outline-text-3" id="text-2-1">
<p>
Generic products:
</p>
<ul class="org-ul">
<li>Stand-alone systems that are marketed and sold to any customer who wishes to buy them.</li>
<li>Examples: PC software such as graphics programs, project management tools, photoshop software, software for specific markets such as appointment systems for dentists.</li>
<li>The specifications are governed by the programmers.</li>
</ul>

<p>
Customized products:
</p>
<ul class="org-ul">
<li>Software that is commissioned by a specific customer to meet their own needs.</li>
<li>Examples: Air traffic control software, traffic monitoring systems, embedded control software.</li>
<li>The specifications are governed by the people who bought the software.</li>
</ul>
</div>
</div>
<div id="outline-container-org243944d" class="outline-3">
<h3 id="org243944d"><span class="section-number-3">2.2.</span> Attributes of software</h3>
<div class="outline-text-3" id="text-2-2">
<p>
Good attributes:
</p>
<ul class="org-ul">
<li>Maintainability (easy to make changes going forward.)</li>
<li>Dependability and Security (reliability, security, and safety. is not dangerous to the computer.)</li>
<li>Efficiency (memory and storage efficent. do not waste resources.)</li>
<li>Acceptability (acceptable to the users for which it is designed for. user-friendly and compatable with other systems that they use.)</li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org2fc8abb" class="outline-2">
<h2 id="org2fc8abb"><span class="section-number-2">3.</span> Software process acitivities.</h2>
<div class="outline-text-2" id="text-3">
<p>
A software process is a sequence of activities that leads to the production of a software product.
</p>
<ol class="org-ol">
<li>Software specification - Where customers and engineers define the software that is to be produced and the constraints on its operation.</li>
<li>Software development - Where the software is designed and programmed.</li>
<li>Software validation - Where the software is checked to ensure that it is what the customer requires.</li>
<li>Software evolution - Where the software is modified to reflect changing customer and market requirements.</li>
</ol>

<p>
There is no universal set of software techniques that is applicable to all of these.
</p>

<p>
The techniques you use are dependent on the type of application, the requirements of the customer, and the background of the development team.
</p>

<p>
There are various different type of applications:
</p>
<ul class="org-ul">
<li>Stand-alone application - Applications that include all neccisary functionality and do not need to be connected to a network.</li>
<li>Interactive transaction-based applications - Application that execute on a seperate computer away from their own PC. E-commerce applications, Amazon, Netflix, etc.</li>
<li>Embedded control systems - Software control systems that control and manage hardware devices. More likely than any other software system. Elevators, anti-lock braking in a car, and a microwave to cook. Often not possible to update (due to ROM.)</li>
<li>Batch processing systems - Business systems that are designed to process data in large batches. Process large numbers of individual inputs to create corresponding outputs. Electric billing systems, salary payment systems.</li>
<li>Entertainment systems - Often for personal use which are intended to entertain the user. Gaming consoles, netflix, etc.</li>
<li>Systems for modeling and simulation - Developed by scientests and engineers to model physical processes or situations which include many seperate, interacting objects. Require high-performance. Pilot software, Matlab, Gnu Octave, etc.</li>
<li>Data collection systems - Telemetry. Analyze &ldquo;big data&rdquo; which involves cloud-based systems carrying out systistical analysis and looking for relationships in such data.</li>
<li>Systems of systems - Systems that are composed of a number of other software systems. Military command and control systems (NORAD)</li>
</ul>

<p>
Development of web browsers (around 2000) that could run small programs and do some local processing led to an evolution in business and organizational software. Instead of writing software and deploying it on users&rsquo; PCs, the software was deployed on a web server. With the help of web browsers, instead of writing software and deploying it on users PCs, it could be deployed on a web server. It make it so much easier to change and upgrade the software. The fundamental ideas of software engineering apply to web-based software in the same way that they apply to other types of software system. Outlook, Microsoft Office 365, Amazon, and Adobe Creative Suite.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Kieran Lavato</p>
<p class="date">Created: 2025-01-17 Fri 17:38</p>
</div>
</body>
</html>
